const faqData = [
  { title: 'На Вашем сайте описаны все типы фундаментов, которые Вы делаете или возможны другие варианты?', description: 'На нашем сайте описаны самые популярные типы фундаментов, но возможны и другие. Наши инженеры подберут оптимальный вариант для Ваших условий.' },
  { title: 'Возможно ли строительство по моему проекту?', description: 'Да, мы с удовольствием выполним расчет и строительство вашего проекта.' },
  { title: 'Может ли измениться стоимость договора заключенного Заказчиком с Вашей фирмой?', description: 'При заключении Договора сумма в рублях фиксируется на все время строительства. Если во время работ Заказчик принимает решение на дополнительные работы, то они просчитываются и заключается дополнительное соглашение. Только в этом случае сумма договора меняется.' },
  { title: 'Возможно ли изменение проекта по желанию заказчика? Как это отразится на его стоимости?', description: 'Изменение проекта возможно. Проект и его изменения для нашего заказчика – бесплатно.' },
  { title: 'Можно ли купить проект дома?', description: 'Да, это возможно. Цена на проектирование обговаривается с менеджером.' },
  { title: 'Откуда ваши бригады?', description: 'Все наши рабочие россияне – из Вологодской, Нижегородской и Кировской областей.' },
  { title: 'В какое время года лучше приступить к строительству дома?', description: 'Каждое время года имеет свое преимущество. Более подробно можно узнать у наших менеджеров.' },
  { title: 'Возможно ли строительство дома на моём фундаменте?', description: 'Да, возможно. При необходимости мы можем модернизировать или достроить ваш фундамент.' },
  { title: 'Какие документы необходимы для заключения договора?', description: 'При заключении договора необходим паспорт и документ о праве собственности на земельный участок.' },
  { title: 'Какой срок занимает строительство дома?', description: 'Срок строительства дома колеблется от двух до пяти месяцев.' },
  { title: 'Как производится оплата при строительства дома?', description: 'Оплату можно производить как по наличному, так и по безналичному расчету, наши реквизиты будут указаны в Договоре подряда.' },
  { title: 'Можно ли отзеркалить проект? Вход в дом нужен с другой стороны.', description: 'Дом можно отзеркалить. Такие дома уже строились.' },
  { title: 'Возможно ли заливать бетон в зимнее время? Бетон не замерзнет?', description: 'В зимнее время бетон с заводов отпускается с противоморозными добавками, которые не позволяют воде кристаллизоваться. Единственное отличие – бетон с противоморозными добавками набирает прочность заметно медленнее.' },
];

export default faqData;
