import InternalLink from "components/UI/InternalLink";
import Typography from "components/UI/Typography";
import Container from "components/UI/Container";
import ListItem from "components/UI/ListItem";
import List from "components/UI/List";
import Icon from "components/UI/Icon";
import Box from "components/UI/Box";

const features = [
  {
    title: 'Качественные дома',
    icon: (
      <Icon viewBox="64 64 896 896">
        <path d="M946.5 505L560.1 118.8l-25.9-25.9a31.5 31.5 0 00-44.4 0L77.5 505a63.9 63.9 0 00-18.8 46c.4 35.2 29.7 63.3 64.9 63.3h42.5V940h691.8V614.3h43.4c17.1 0 33.2-6.7 45.3-18.8a63.6 63.6 0 0018.7-45.3c0-17-6.7-33.1-18.8-45.2zM568 868H456V664h112v204zm217.9-325.7V868H632V640c0-22.1-17.9-40-40-40H432c-22.1 0-40 17.9-40 40v228H238.1V542.3h-96l370-369.7 23.1 23.1L882 542.3h-96.1z" />
      </Icon>
    ),
  },
  {
    title: 'Эко-безопасность',
    icon: (
      <Icon viewBox="0 0 24 24">
        <path d="M15.49 9.63c-.18-2.79-1.31-5.51-3.43-7.63-2.14 2.14-3.32 4.86-3.55 7.63 1.28.68 2.46 1.56 3.49 2.63 1.03-1.06 2.21-1.94 3.49-2.63zm-3.44-4.44c.63 1.03 1.07 2.18 1.3 3.38-.47.3-.91.63-1.34.98-.42-.34-.87-.67-1.33-.97.25-1.2.71-2.35 1.37-3.39zM12 15.45c-.82-1.25-1.86-2.34-3.06-3.2-.13-.09-.27-.16-.4-.26.13.09.27.17.39.25C6.98 10.83 4.59 10 2 10c0 5.32 3.36 9.82 8.03 11.49.63.23 1.29.4 1.97.51.68-.12 1.33-.29 1.97-.51C18.64 19.82 22 15.32 22 10c-4.18 0-7.85 2.17-10 5.45zm1.32 4.15c-.44.15-.88.27-1.33.37-.44-.09-.87-.21-1.28-.36-3.29-1.18-5.7-3.99-6.45-7.35 1.1.26 2.15.71 3.12 1.33l-.02.01c.13.09.26.18.39.25l.07.04c.99.72 1.84 1.61 2.51 2.65L12 19.1l1.67-2.55c.69-1.05 1.55-1.95 2.53-2.66l.07-.05c.09-.05.18-.11.27-.17l-.01-.02c.98-.65 2.07-1.13 3.21-1.4-.75 3.37-3.15 6.18-6.42 7.35zm-4.33-7.32c-.02-.01-.04-.03-.05-.04 0 0 .01 0 .01.01.01.01.02.02.04.03z" />
      </Icon>
    ),
  },
  {
    title: 'Команда профессионалов',
    icon: (
      <Icon viewBox="0 0 512 512">
        <path d="M154.8,341.66a44.21,44.21,0,0,1,22.46-12.15A44.5,44.5,0,0,1,211.77,295a44.65,44.65,0,0,1,34.54-34.54,43.92,43.92,0,0,1,2.76-8.43,48.28,48.28,0,0,1-8.19-6.44,47.56,47.56,0,0,1-9.68-13.93L40.65,423.33a43.79,43.79,0,0,0,61.93,61.93L169,418.85l-14.2-14.2A44.6,44.6,0,0,1,154.8,341.66Z" />
        <path d="M499.28,90.12a9.24,9.24,0,0,0-13.09,0l-36.84,36.8a16.52,16.52,0,0,1-23.41,0L399,100a16.5,16.5,0,0,1,0-23.43l36.83-36.82a9.26,9.26,0,0,0,0-13.1,43.37,43.37,0,0,0-55.69-4.77L360.08,36A76,76,0,0,0,328,94.06l-2.36,44.27L306.1,157.89a92.61,92.61,0,0,1,7.7,18.39l6.52,22.18a47.68,47.68,0,0,1-3.63,35.65,44.82,44.82,0,0,1,4.75,3.9l14.19,14.19,52-52,44.24-2.37a76,76,0,0,0,58.07-32.06l14.15-20A43.36,43.36,0,0,0,499.28,90.12Z" />
        <path d="M104.65,326h0l133.91-133.9c3.42,4.18,3.21,6.13,9.52,27.55A27.59,27.59,0,1,0,301,204.13L294.5,182a70.35,70.35,0,0,0-67.76-50.79c-3.84,0-61.9,3.85-65.75,4.1l-17.64-17.64-6.81-6.81a44.35,44.35,0,0,0-62.72,0L13,171.66a44.35,44.35,0,0,0,0,62.72Z" />
        <path d="M307.22,252.25c-23.32-23.32-56.82,12.26-34.53,34.54a24.43,24.43,0,0,0-34.55,34.54,24.43,24.43,0,0,0-34.55,34.55A24.42,24.42,0,0,0,169,390.43l58.15,58.15A24.43,24.43,0,0,0,261.73,414a24.43,24.43,0,0,0,34.55-34.55,24.43,24.43,0,0,0,41.25-21.93c-.89-4.62-4.5-10.67-3.32-9.85a24.4,24.4,0,0,0,31.16-37.31Z" />
      </Icon>
    ),
  },
  {
    title: 'Видеонаблюдение 24/7',
    icon: (
      <Icon viewBox="64 64 896 896">
        <path d="M945 412H689c-4.4 0-8 3.6-8 8v48c0 4.4 3.6 8 8 8h256c4.4 0 8-3.6 8-8v-48c0-4.4-3.6-8-8-8zM811 548H689c-4.4 0-8 3.6-8 8v48c0 4.4 3.6 8 8 8h122c4.4 0 8-3.6 8-8v-48c0-4.4-3.6-8-8-8zM477.3 322.5H434c-6.2 0-11.2 5-11.2 11.2v248c0 3.6 1.7 6.9 4.6 9l148.9 108.6c5 3.6 12 2.6 15.6-2.4l25.7-35.1v-.1c3.6-5 2.5-12-2.5-15.6l-126.7-91.6V333.7c.1-6.2-5-11.2-11.1-11.2z" />
        <path d="M804.8 673.9H747c-5.6 0-10.9 2.9-13.9 7.7a321 321 0 01-44.5 55.7 317.17 317.17 0 01-101.3 68.3c-39.3 16.6-81 25-124 25-43.1 0-84.8-8.4-124-25-37.9-16-72-39-101.3-68.3s-52.3-63.4-68.3-101.3c-16.6-39.2-25-80.9-25-124 0-43.1 8.4-84.7 25-124 16-37.9 39-72 68.3-101.3 29.3-29.3 63.4-52.3 101.3-68.3 39.2-16.6 81-25 124-25 43.1 0 84.8 8.4 124 25 37.9 16 72 39 101.3 68.3a321 321 0 0144.5 55.7c3 4.8 8.3 7.7 13.9 7.7h57.8c6.9 0 11.3-7.2 8.2-13.3-65.2-129.7-197.4-214-345-215.7-216.1-2.7-395.6 174.2-396 390.1C71.6 727.5 246.9 903 463.2 903c149.5 0 283.9-84.6 349.8-215.8a9.18 9.18 0 00-8.2-13.3z" />
      </Icon>
    ),
  },
];

const AboutSection = () => (
  <section className="about">
    <Container>
      <figure className="about-banner">
        <img src="/images/about.png" alt="House interior" />
      </figure>

      <Box className="about-content">
        <Typography tag="p" className="subtitle">О нас</Typography>

        <Typography tag="h2" className="h2 title">Загородные коттеджи немецкого качества</Typography>

        <Typography tag="p" className="about-text">
          Мы, ведущая компания в строительстве загородных коттеджей, уже более 7-ми держим стандарт качества.
          <br />
          Наша специализация - каменные дома премиум-класса для постоянного проживания.
          <br />
          Давно хотели построить дом-мечты? Выбирайте проект - остальное за нами!
        </Typography>

        <List className="about-list">
          {features.map((feature) => (
            <ListItem key={feature.title} className="about-item">
              <Box className="icon-wrapper">
                {feature.icon}
              </Box>

              <Typography tag="p">
                {feature.title}
              </Typography>
            </ListItem>
          ))}
        </List>

        <Typography tag="p" className="callout">
          Мы строим только качественные дома и уверены в них.
          На каждый наш дом и все выполненные работы мы даем гарантию 10 лет.
        </Typography>

        <InternalLink href="/projects" className="button slider">
          Проекты
        </InternalLink>
      </Box>
    </Container>
  </section>
);
export default AboutSection;
