export const defaultPreview = "" +
  "Каркасный коттедж “Арвид” впечатляет с первого взгляда. " +
  "Дом выполнен в классическом стиле. А особое очарование ему придет терраса, над которой разместился балкон";

export const defaultDesc = "" +
  "Каркасный коттедж “Свод” впечатляет с первого взгляда. " +
  "Дом выполнен в классическом стиле, и в стандартном проекте всё в нём играет на контрастах: " +
  "двускатная крыша, дерево и камень на фасадах, чёрно-белая расцветка. " +
  "Особое очарование каркасному коттеджу придаёт терраса, над которой разместился балкон. " +
  "В плане предусмотрено 5 комнат, 2 санузла и кухня, совмещённая с залом. " +
  "Для максимального ощущения связи к природой использовано панорамное остекление.";
