export const common1 = [
  {
    id: 1,
    title: 'Фундамент',
    paragraphs: [
      {
        id: 1,
        content: 'Монтаж винтовых свай с металлическим оголовком 200*200 мм ВС-108/300/2500мм, ТУ 5260-001-84045723-2011 с использованием спецтехники. Двойная гидроизоляция фундамента – гидростеклоизол.'
      }
    ]
  },
  {
    id: 2,
    title: 'Инженерные коммуникации',
    paragraphs: [
      {
        id: 1,
        content: 'Монтаж гильз для ввода канализации и водоснабжения'
      }
    ]
  },
  {
    id: 3,
    title: 'Высота 1 этажа',
    paragraphs: [
      {
        id: 1,
        content: '270 см'
      }
    ]
  },
  {
    id: 4,
    title: 'Высота 2 этажа',
    paragraphs: [
      {
        id: 1,
        content: '250 см'
      }
    ]
  },
  {
    id: 5,
    title: 'Высота аттиковой стены (наружной стены второго этажа)',
    paragraphs: [
      {
        id: 1,
        content: '150 см'
      }
    ]
  },
  {
    id: 6,
    title: 'Стойки каркаса',
    paragraphs: [
      {
        id: 1,
        content: 'Строганный калиброванный брус камерной сушки 150х50 мм из древесины хвойных пород с шагом не более 580 мм'
      },
      {
        id: 2,
        content: 'Контробрешетка из бруса 35 x 35 мм или 45 x 45'
      },
      {
        id: 3,
        content: 'Диагональное укрепление стен'
      },
      {
        id: 4,
        content: 'Усиленная оцинкованная крепежная система, огнебиозащита'
      },
    ]
  },
  {
    id: 7,
    title: 'Цокольное перекрытие',
    paragraphs: [
      {
        id: 1,
        content: 'Обвязка каркаса из бруса 150х200мм'
      },
      {
        id: 2,
        content: 'Лаги - сухая строганная доска 200х50 мм, шаг 580 мм'
      },
    ]
  },
  {
    id: 8,
    title: 'Межэтажное перекрытие',
    paragraphs: [
      {
        id: 1,
        content: 'Усиленные балки из сухой строганной доски камерной сушки сечением 50х200 мм'
      }
    ]
  },
  {
    id: 9,
    title: 'Стропильная система',
    paragraphs: [
      {
        id: 1,
        content: 'Калиброванный брус 200*50(150Х50) мм 1 сорта с шагом не более 580мм'
      },
      {
        id: 2,
        content: 'Обрешётка 25х100 мм из древесины хвойных пород'
      },
      {
        id: 3,
        content: 'Контробрешётка - брусок 50х50 мм'
      },
    ]
  },
  {
    id: 10,
    title: 'Антисептирование',
    paragraphs: [
      {
        id: 1,
        content: 'Антисептирование всех ключевых конструкций'
      }
    ]
  },
  {
    id: 11,
    title: 'Кровля',
    paragraphs: [
      {
        id: 1,
        content: 'Металлочерепица с покрытием полиэстер'
      },
      {
        id: 2,
        content: 'Высококачественная гидро-ветрозащитная диффузионная мембрана. Паро-гидроизоляционная мембрана'
      },
      {
        id: 3,
        content: 'Устройство вентиляции подкровельного пространства'
      },
      {
        id: 4,
        content: 'Технология вентилируемая кровля'
      },
      {
        id: 5,
        content: 'Водосточная система - пластиковая Docke'
      },
    ]
  },
]

export const common2 = [
  {
    id: 13,
    title: 'Наружная отделка стен',
    paragraphs: [
      {
        id: 1,
        content: 'Высококачественная доска Имитация бруса'
      },
      {
        id: 2,
        content: 'Свесы, наличники, углы – сухая строганная доска'
      },
      {
        id: 3,
        content: 'Настил террас - террасная доска вельвет, хвоя'
      },
      {
        id: 4,
        content: 'Устройство ограждений - сухая строганная доска'
      },
    ]
  },
  {
    id: 14,
    title: 'Вентилируемый фасад',
    paragraphs: [
      {
        id: 1,
        content: 'Контробрешетка из бруса 35 x 35 мм или 45 x 45'
      }
    ]
  },
];

export const common3 = [
  {
    id: 20,
    title: 'Оконные конструкции',
    paragraphs: [
      {
        id: 1,
        content: 'ПВХ REHAU Grazio, 5-ти камерный профиль Rehau 70мм, двухкамерные стеклопакеты.'
      },
      {
        id: 2,
        content: 'Фурнитура: ROTO NT.'
      },
      {
        id: 3,
        content: 'Монтаж металлических оцинкованных подоконных отливов.'
      },
    ]
  },
];

export const common4 = [
  {
    id: 23,
    title: 'Террасы и балконы',
    paragraphs: [
      {
        id: 1,
        content: 'Устройство террас при наличии в проекте.'
      },
      {
        id: 2,
        content: 'Устройство балконов при наличии в проекте.'
      },
    ]
  },
  {
    id: 24,
    title: 'Подготовительные и завершающие работы',
    paragraphs: [
      {
        id: 1,
        content: 'Создание индивидуального или адаптация типового проекта.'
      },
      {
        id: 2,
        content: 'Подготовка полного комплекта документов для кадастровой палаты (для получения разрешения на строительство).'
      },
      {
        id: 3,
        content: 'Выезд инженера на участок для проведения геодезических изысканий.'
      },
      {
        id: 4,
        content: 'Доставка строительных материалов (до 100 км от МКАД).'
      },
      {
        id: 5,
        content: 'Все строительно-монтажные работы.'
      },
      {
        id: 6,
        content: 'Уборка строительного мусора на участке по окончании строительства.'
      },
    ]
  }
];
