const common1 = [
  {
    id: 1,
    title: 'Фундамент',
    paragraphs: [
      {
        id: 1,
        content: 'Монтаж винтовых свай с металлическим оголовком 200*200 мм ВС-108/300/2500мм, ТУ 5260-001-84045723-2011 с использованием спецтехники. Двойная гидроизоляция фундамента – гидростеклоизол.'
      }
    ]
  },
  {
    id: 2,
    title: 'Инженерные коммуникации',
    paragraphs: [
      {
        id: 1,
        content: 'Монтаж гильз для ввода канализации и водоснабжения'
      }
    ]
  },
  {
    id: 3,
    title: 'Высота 1 этажа',
    paragraphs: [
      {
        id: 1,
        content: '270 см'
      }
    ]
  },
  {
    id: 4,
    title: 'Высота 2 этажа',
    paragraphs: [
      {
        id: 1,
        content: '250 см'
      }
    ]
  },
  {
    id: 5,
    title: 'Высота аттиковой стены (наружной стены второго этажа)',
    paragraphs: [
      {
        id: 1,
        content: '150 см'
      }
    ]
  },
  {
    id: 6,
    title: 'Стойки каркаса',
    paragraphs: [
      {
        id: 1,
        content: 'Строганный калиброванный брус камерной сушки 150х50 мм из древесины хвойных пород с шагом не более 580 мм'
      },
      {
        id: 2,
        content: 'Контробрешетка из бруса 35 x 35 мм или 45 x 45'
      },
      {
        id: 3,
        content: 'Диагональное укрепление стен'
      },
      {
        id: 4,
        content: 'Усиленная оцинкованная крепежная система, огнебиозащита'
      },
    ]
  },
  {
    id: 7,
    title: 'Цокольное перекрытие',
    paragraphs: [
      {
        id: 1,
        content: 'Обвязка каркаса из бруса 150х200мм'
      },
      {
        id: 2,
        content: 'Лаги - сухая строганная доска 200х50 мм, шаг 580 мм'
      },
    ]
  },
  {
    id: 8,
    title: 'Межэтажное перекрытие',
    paragraphs: [
      {
        id: 1,
        content: 'Усиленные балки из сухой строганной доски камерной сушки сечением 50х200 мм'
      }
    ]
  },
  {
    id: 9,
    title: 'Стропильная система',
    paragraphs: [
      {
        id: 1,
        content: 'Калиброванный брус 200*50(150Х50) мм 1 сорта с шагом не более 580мм'
      },
      {
        id: 2,
        content: 'Обрешётка 25х100 мм из древесины хвойных пород'
      },
      {
        id: 3,
        content: 'Контробрешётка - брусок 50х50 мм'
      },
    ]
  },
  {
    id: 10,
    title: 'Антисептирование',
    paragraphs: [
      {
        id: 1,
        content: 'Антисептирование всех ключевых конструкций'
      }
    ]
  },
  {
    id: 11,
    title: 'Кровля',
    paragraphs: [
      {
        id: 1,
        content: 'Металлочерепица с покрытием полиэстер'
      },
      {
        id: 2,
        content: 'Высококачественная гидро-ветрозащитная диффузионная мембрана. Паро-гидроизоляционная мембрана'
      },
      {
        id: 3,
        content: 'Устройство вентиляции подкровельного пространства'
      },
      {
        id: 4,
        content: 'Технология вентилируемая кровля'
      },
      {
        id: 5,
        content: 'Водосточная система - пластиковая Docke'
      },
    ]
  },
]

const common2 = [
  {
    id: 13,
    title: 'Наружная отделка стен',
    paragraphs: [
      {
        id: 1,
        content: 'Высококачественная доска Имитация бруса'
      },
      {
        id: 2,
        content: 'Свесы, наличники, углы – сухая строганная доска'
      },
      {
        id: 3,
        content: 'Настил террас - террасная доска вельвет, хвоя'
      },
      {
        id: 4,
        content: 'Устройство ограждений - сухая строганная доска'
      },
    ]
  },
  {
    id: 14,
    title: 'Вентилируемый фасад',
    paragraphs: [
      {
        id: 1,
        content: 'Контробрешетка из бруса 35 x 35 мм или 45 x 45'
      }
    ]
  },
];

const common3 = [
  {
    id: 20,
    title: 'Оконные конструкции',
    paragraphs: [
      {
        id: 1,
        content: 'ПВХ REHAU Grazio, 5-ти камерный профиль Rehau 70мм, двухкамерные стеклопакеты.'
      },
      {
        id: 2,
        content: 'Фурнитура: ROTO NT.'
      },
      {
        id: 3,
        content: 'Монтаж металлических оцинкованных подоконных отливов.'
      },
    ]
  },
];

const common4 = [
  {
    id: 23,
    title: 'Террасы и балконы',
    paragraphs: [
      {
        id: 1,
        content: 'Устройство террас при наличии в проекте.'
      },
      {
        id: 2,
        content: 'Устройство балконов при наличии в проекте.'
      },
    ]
  },
  {
    id: 24,
    title: 'Подготовительные и завершающие работы',
    paragraphs: [
      {
        id: 1,
        content: 'Создание индивидуального или адаптация типового проекта.'
      },
      {
        id: 2,
        content: 'Подготовка полного комплекта документов для кадастровой палаты (для получения разрешения на строительство).'
      },
      {
        id: 3,
        content: 'Выезд инженера на участок для проведения геодезических изысканий.'
      },
      {
        id: 4,
        content: 'Доставка строительных материалов (до 100 км от МКАД).'
      },
      {
        id: 5,
        content: 'Все строительно-монтажные работы.'
      },
      {
        id: 6,
        content: 'Уборка строительного мусора на участке по окончании строительства.'
      },
    ]
  }
];

export const data: {
  packages: Array<Package>
} = {
  packages: [
    {
      id: 1,
      title: 'Закрытый контур',
      blocks: [
        ...common1,
        {
          id: 12,
          title: 'Тепло-, звукоизоляция и защита каркаса',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
              content: 'Наружные стены: экологически чистый базальтовый утеплитель Rockwool Лайт Баттс Скандик/Paroc Extra/Технониколь в 4 слоя (150+50мм) с перекрестным утеплением.'
            },
            {
              id: 2,
              isEmpty: true,
              content: 'Межкомнатные перегородки и межэтажное перекрытие: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 2 слоя.',
            },
            {
              id: 3,
              isEmpty: true,
              content: 'Полы первого этажа: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 4 слоя; гидро-ветро изоляционная мембрана.',
            },
            {
              id: 4,
              isEmpty: true,
              content: 'Чердачное перекрытие: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 4 слоя (200мм). Высококачественная гидро-ветрозащитная диффузионная мембрана.',
            },
          ]
        },
        ...common2,
        {
          id: 15,
          title: 'Внутренняя отделка стен',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
              content: 'Высококачественная пароизоляционная пленка стен, полов, скатов.',
            },
            {
              id: 2,
              isEmpty: true,
              content: 'Сухая обшивочная доска "имитация бруса" (16 мм)',
            },
          ]
        },
        {
          id: 16,
          title: 'Покрытие полов 1-го и 2-го этажей',
          paragraphs: [
            {
              id: 1,
              content: 'Ориентированно-стружечная плита (ОСП-3)                              ',
            },
            {
              id: 2,
              content: 'Обрешетка – сухой строганная доска 35х95 мм, шаг 300 мм',
              isEmpty: true,
            },
            {
              id: 3,
              content: 'Пароизоляция',
              isEmpty: true,
            }
          ]
        },
        {
          id: 17,
          title: 'Отделка потолков 1-го и 2-го этажей',
          paragraphs: [
            {
              id: 1,
              content: 'Сухая обшивочная доска «евровагонка» класса А-B',
              isEmpty: true,
            },
            {
              id: 2,
              content: 'Сухая обшивочная доска «евровагонка» класса А-B',
              isEmpty: true,
            },
          ]
        },
        {
          id: 18,
          title: 'Внутренняя отделка стен санузлов',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
            }
          ]
        },
        {
          id: 19,
          title: 'Отделка потолка санузлов',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
            }
          ]
        },
        ...common3,
        {
          id: 21,
          title: 'Дверь',
          paragraphs: [
            {
              id: 1,
              content: 'Входная утеплённая металлическая дверь'
            },
            {
              id: 2,
              isEmpty: true,
            },
          ]
        },
        {
          id: 22,
          title: 'Межэтажная лестница',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
            }
          ]
        },
        ...common4
      ]
    },
    {
      id: 2,
      title: 'Теплый контур',
      blocks: [
        ...common1,
        {
          id: 12,
          title: 'Тепло-, звукоизоляция и защита каркаса',
          paragraphs: [
            {
              id: 1,
              content: 'Наружные стены: экологически чистый базальтовый утеплитель Rockwool Лайт Баттс Скандик/Paroc Extra/Технониколь в 4 слоя (150+50мм) с перекрестным утеплением.'
            },
            {
              id: 2,
              content: 'Межкомнатные перегородки и межэтажное перекрытие: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 2 слоя.',
            },
            {
              id: 3,
              content: 'Полы первого этажа: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 4 слоя; гидро-ветро изоляционная мембрана.',
            },
            {
              id: 4,
              content: 'Чердачное перекрытие: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 4 слоя (200мм). Высококачественная гидро-ветрозащитная диффузионная мембрана.',
            },
          ]
        },
        ...common2,
        {
          id: 15,
          title: 'Внутренняя отделка стен',
          paragraphs: [
            {
              id: 1,
              content: 'Высококачественная пароизоляционная пленка стен, полов, скатов.',
            },
            {
              id: 2,
              isEmpty: true,
              content: 'Сухая обшивочная доска "имитация бруса" (16 мм)',
            },
          ]
        },
        {
          id: 16,
          title: 'Покрытие полов 1-го и 2-го этажей',
          paragraphs: [
            {
              id: 1,
              content: 'Настил пола – влагостойкая ДСП шпунтованная плита 22 мм'
            },
            {
              id: 2,
              content: 'Обрешетка – сухой строганная доска 35х95 мм, шаг 300 мм',
            },
            {
              id: 3,
              content: 'Пароизоляция',
            }
          ]
        },
        {
          id: 17,
          title: 'Отделка потолков 1-го и 2-го этажей',
          paragraphs: [
            {
              id: 1,
              content: 'Сухая обшивочная доска «евровагонка» класса А-B',
              isEmpty: true,
            },
            {
              id: 2,
              content: 'Сухая обшивочная доска «евровагонка» класса А-B',
              isEmpty: true,
            },
          ]
        },
        {
          id: 18,
          title: 'Внутренняя отделка стен санузлов',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
            }
          ]
        },
        {
          id: 19,
          title: 'Отделка потолка санузлов',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
            }
          ]
        },
        ...common3,
        {
          id: 21,
          title: 'Дверь',
          paragraphs: [
            {
              id: 1,
              content: 'Входная утеплённая металлическая дверь'
            },
            {
              id: 2,
              isEmpty: true,
            },
          ]
        },
        {
          id: 22,
          title: 'Межэтажная лестница',
          paragraphs: [
            {
              id: 1,
              isEmpty: true,
            }
          ]
        },
        ...common4
      ]
    },
    {
      id: 3,
      title: 'С отделкой',
      blocks: [
        ...common1,
        {
          id: 12,
          title: 'Тепло-, звукоизоляция и защита каркаса',
          paragraphs: [
            {
              id: 1,
              content: 'Наружные стены: экологически чистый базальтовый утеплитель Rockwool Лайт Баттс Скандик/Paroc Extra/Технониколь в 4 слоя (150+50мм) с перекрестным утеплением.'
            },
            {
              id: 2,
              content: 'Межкомнатные перегородки и межэтажное перекрытие: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 2 слоя.',
            },
            {
              id: 3,
              content: 'Полы первого этажа: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 4 слоя; гидро-ветро изоляционная мембрана.',
            },
            {
              id: 4,
              content: 'Чердачное перекрытие: экологически чистый базальтовый утеплитель Paroc EXTRA или ROCKWOOL ЛАЙТ БАТТС в 4 слоя (200мм). Высококачественная гидро-ветрозащитная диффузионная мембрана.',
            },
          ]
        },
        ...common2,
        {
          id: 15,
          title: 'Внутренняя отделка стен',
          paragraphs: [
            {
              id: 1,
              content: 'Высококачественная пароизоляционная пленка стен, полов, скатов.',
            },
            {
              id: 2,
              content: 'Сухая обшивочная доска "имитация бруса" (16 мм)',
            },
          ]
        },
        {
          id: 16,
          title: 'Покрытие полов 1-го и 2-го этажей',
          paragraphs: [
            {
              id: 1,
              content: 'Настил пола – влагостойкая ДСП шпунтованная плита 22 мм'
            },
            {
              id: 2,
              content: 'Обрешетка – сухой строганная доска 35х95 мм, шаг 300 мм',
            },
            {
              id: 3,
              content: 'Пароизоляция',
            }
          ]
        },
        {
          id: 17,
          title: 'Отделка потолков 1-го и 2-го этажей',
          paragraphs: [
            {
              id: 1,
              content: 'Сухая обшивочная доска «евровагонка» класса А-B',
            },
            {
              id: 2,
              content: 'Отделка плинтусами потолков, полов, углов комнат',
            },
          ]
        },
        {
          id: 18,
          title: 'Внутренняя отделка стен санузлов',
          paragraphs: [
            {
              id: 1,
              content: 'Высококачественный ГВЛВ',
            }
          ]
        },
        {
          id: 19,
          title: 'Отделка потолка санузлов',
          paragraphs: [
            {
              id: 1,
              content: 'Высококачественный ГКЛВ',
            }
          ]
        },
        ...common3,
        {
          id: 21,
          title: 'Дверь',
          paragraphs: [
            {
              id: 1,
              content: 'Входная утеплённая металлическая дверь'
            },
            {
              id: 2,
              content: 'Межкомнатные – экошпон с доборами и наличниками с двух сторон',
            },
          ]
        },
        {
          id: 22,
          title: 'Межэтажная лестница',
          paragraphs: [
            {
              id: 1,
              content: 'Монтаж лестницы из сухого строганного материала, с перилами',
            }
          ]
        },
        ...common4
      ]
    },
  ]
}
